setwd("/home/agricolamz/work/materials/2018_mosfindata_hackathon/4")
library(tidyverse)
df <- read_csv("not_commit/report.csv")

a <- which(df$category == "Доходы местного бюджета, фактически исполненные, тысяча рублей")

df$place <- ""
df$place[a-2] <- df$category[a-2]

repetitions <- data_frame(n = c(a[-1], nrow(df))-a, 
                          place = df$category[a-1])

final <- character()

sapply(1:nrow(repetitions), function(id){
  final <<- c(final, rep(repetitions$place[id], repetitions$n[id]))
})

df$place <- c(final, NA,NA)

df %>% 
  slice(-c(a-1)) %>% 
  filter(!is.na(category)) %>% 
  mutate(place = case_when(
    place == "Академическое" ~ "Академический",
    place == "Алексеевское" ~ "Алексеевский",
    place == "Алтуфьевское" ~ "Алтуфьевский", 
    place == "Бабушкинское" ~ "Бабушкинский",
    place == "Басманное" ~ "Басманный",
    place == "Беговое" ~ "Беговой", 
    place == "Бескудниковское" ~ "Бескудниковский",
    place == "Бутырское" ~ "Бутырский",
    place == "Войковское" ~ "Войковский", 
    place == "Гагаринское" ~ "Гагаринский",
    place == "Головинское" ~ "Головинский",
    place == "Даниловское" ~ "Даниловский", 
    place == "Косино-Ухтомское" ~ "Косино-Ухтомский",
    place == "Красносельское" ~ "Красносельский", 
    place == "Левобережное" ~ "Левобережный", 
    place == "Ломоносовское" ~ "Ломоносовский", 
    place == "Лосиноостровское" ~ "Лосиноостровский", 
    place == "Марьина Роща" ~ "Марьина роща", 
    place == "Мещанское" ~ "Мещанский", 
    place == "Можайское" ~ "Можайский", 
    place == "Молжаниновское" ~ "Молжаниновский",     
    place == "Нагатинский Затон" ~ "Нагатинский затон",     
    place == "Нагорное" ~ "Нагорный",     
    place == "Нижегородское" ~ "Нижегородский",     
    place == "Обручевское" ~ "Обручевский",     
    place == "Останкинское" ~ "Останкинский",     
    place == 'поселение "Мосрентген"' ~ 'Поселение "Мосрентген"',
    place == "Пресненское" ~ "Пресненский",     
    place == "Рязанское" ~ "Рязанский",     
    place == "Савеловское" ~ "Савеловский",     
    place == "Северное" ~ "Северный",     
    place == "Соколиная Гора" ~ "Соколиная гора",  
    place == "Таганское" ~ "Таганский",     
    place == "Тверское" ~ "Тверской",     
    place == "Тимирязевское" ~ "Тимирязевский",     
    place == "Филевский Парк" ~ "Филевский парк",
    place == "Хорошевское" ~ "Хорошевский",     
    place == "Южнопортовое" ~ "Южнопортовый",     
    place == "Ярославское" ~ "Ярославский",
    place == "городской округ Троицк" ~ "Городской округ Троицк",    
    place == "городской округ Щербинка" ~ "Городской округ Щербинка",  
    TRUE ~ place),
    place = str
    )->
  df

df %>% 
  distinct(place) %>% 
  full_join(moscow@data, c("place" = "NAME")) %>% 
  View()
  
